{
    "name": "Neurology",
    "icon": "🧠",
    "compensation": {
        "median": "$369,011",
        "range": "$315,652 - $446,457",
        "percentile25": "$315,652",
        "percentile50": "$369,011",
        "percentile75": "$446,457",
        "workRVUs": "5,059 (median)",
        "compensationPerRVU": "$70.19 (median)",
        "privateVsAcademic": "Private ~$370k vs Hospital-Employed ~$344k vs Academic ~$315k"
    },
    "painPoints": [
        {
            "category": "Burnout & Work-Life Balance Crisis",
            "points": [
                "60% of neurologists experiencing burnout symptoms - second-highest rate among all specialties",
                "Only 67% would choose neurology again despite 88% finding work meaningful",
                "High emotional exhaustion from progressive, life-altering neurologic conditions",
                "Poor work-life balance compared to other specialties",
                "Psychological trauma from caring for patients with conditions affecting personality and cognition",
                "Limited recovery time between demanding hospital shifts and outpatient clinics"
            ]
        },
        {
            "category": "Administrative Burden & EHR Overload",
            "points": [
                "Spending 2 hours on EHR/desk work for every 1 hour of direct patient care",
                "Average 18 hours per week on paperwork and administrative tasks",
                "Complex neurologic exam documentation not well-supported by most EHR systems",
                "Excessive inbox management with detailed patient portal responses required",
                "Prior authorization consuming significant time for imaging and medications",
                "Poor EHR interoperability making it difficult to access outside records"
            ]
        },
        {
            "category": "Call Coverage & Patient Volume Pressure",
            "points": [
                "24/7 stroke coverage with expectation for immediate ED availability",
                "Excessive nights on call correlating directly with burnout risk",
                "Severe shortage with only ~14,000 active neurologists serving entire US (57,000 people per neurologist)",
                "Outpatient volumes of 25-30+ patients per day to maintain productivity",
                "Complex patients requiring 45-60 minute appointments scheduled in 20-minute slots",
                "Growing pressure to provide continuous inpatient coverage while maintaining outpatient practice"
            ]
        },
        {
            "category": "Financial & Compensation Challenges",
            "points": [
                "Compensation among lowest for medical specialties despite high complexity and long training",
                "Declining Medicare reimbursement not keeping pace with practice costs",
                "Significant student loan debt (~$200-300k) with relatively lower earning potential",
                "RVU-based compensation not adequately valuing complex cognitive work",
                "10+ years of training before reaching terminal salary",
                "Hospital fair market value caps limiting compensation despite high demand"
            ]
        },
        {
            "category": "Autonomy Loss & Practice Dissatisfaction",
            "points": [
                "Loss of autonomy with increasing hospital employment and administrative oversight",
                "Feeling like a cog in corporate healthcare machine",
                "Limited control over schedule, patient volume, and clinical decisions",
                "Administrators making clinical decisions without understanding neurology complexity",
                "Lack of support staff while being held to high productivity standards",
                "Caring for devastating conditions with limited treatment options causing emotional toll"
            ]
        }
    ],
    "motivations": [
        "Better work-life balance with predictable schedule and protected personal time",
        "Reduced call burden with equitable coverage distribution",
        "Lower administrative burden with better EHR support and adequate staff",
        "Focus on specific subspecialty interest rather than general neurology",
        "Escape from toxic work environment with poor leadership",
        "Higher compensation to address student loans and financial security",
        "More clinical autonomy and independence in decision-making",
        "Academic affiliation with teaching opportunities",
        "Location change for family reasons or quality of life",
        "Hospital employment for stability without excessive call",
        "More manageable patient volumes with appropriate appointment times",
        "Strong APP support to extend clinical reach"
    ],
    "keyQuestions": {
        "opening": [
            "Tell me about your current practice structure - hospital-employed, private practice, or academic?",
            "Walk me through a typical week - what does your schedule look like and where are the biggest challenges?",
            "What's driving you to explore new opportunities at this point in your career?",
            "Help me understand your mix of inpatient, outpatient, call coverage, and administrative responsibilities"
        ],
        "painDiscovery": [
            "You mentioned [pain point] - help me understand how that's affecting you daily and what impact it's having",
            "Tell me more about what led you to start looking - what was the tipping point?",
            "Describe your call coverage - nights per week, patient volume, and how it's impacting your life",
            "Walk me through your administrative burden - hours in EHR, prior authorizations, inbox management",
            "Help me understand your patient volume expectations versus reality - how does that feel?",
            "What's your experience been with burnout or work-life balance issues in your current role?"
        ],
        "clinical": [
            "Tell me about your subspecialty training and areas of clinical interest",
            "Describe your patient population - percentage general neurology versus subspecialty focused",
            "Help me understand your inpatient versus outpatient split and your preference",
            "Walk me through your stroke coverage experience - comprehensive center, telestroke, primary?",
            "Share your experience with EMG/NCS, EEG interpretation, or other procedures",
            "Tell me about your neurohospitalist experience or interest in dedicated inpatient coverage",
            "Describe your comfort with neurocritical care and ICU patients",
            "What movement disorder, epilepsy, or cognitive/behavioral neurology experience do you have?"
        ],
        "motivation": [
            "When you imagine your ideal practice, what does it look like?",
            "Help me understand what would make a move worthwhile - top three priorities?",
            "Tell me about your decision-making process for evaluating opportunities",
            "Describe what work-life balance means to you specifically in practical terms"
        ],
        "compensation": [
            "Help me understand your complete compensation structure - base, bonuses, call stipends, benefits",
            "Describe how your productivity is measured - RVU-based, collections-based, or straight salary",
            "When you think about your next position, what compensation package would make a move worthwhile?",
            "Help me understand your financial priorities - base security, upside potential, or loan repayment?"
        ]
    },
    "commonChallenges": [
        { 
            "challenge": "I need at least $400k base salary - higher than average", 
            "response": "Help me understand what's driving that expectation - student loans, lifestyle needs, or market research? If I could address your underlying needs differently, how flexible might you be?" 
        },
        { 
            "challenge": "I only want outpatient neurology with zero call coverage", 
            "response": "Help me understand what specifically about call is most problematic - frequency, volume, lack of support? Understanding the 'why' helps me find solutions you might not have considered" 
        },
        { 
            "challenge": "I'm burned out and need complete change", 
            "response": "Walk me through specifically what's causing burnout - volume, call, administrative burden, autonomy? I want your next position to actually solve those problems" 
        },
        { 
            "challenge": "I need to stay in major metropolitan area only", 
            "response": "Tell me what the metro area provides that's essential - schools, culture, family proximity? Sometimes we can solve those needs in locations physicians haven't considered" 
        },
        { 
            "challenge": "I want stroke only, no general neurology patients", 
            "response": "Help me understand your stroke experience and what draws you to it. What percentage stroke versus general would feel right?" 
        },
        { 
            "challenge": "I'm not interested in employed positions - only private practice", 
            "response": "Help me understand what aspects of private practice appeal to you - autonomy, compensation model, culture? There's actually a spectrum between these models" 
        },
        { 
            "challenge": "I need partnership track with ownership potential", 
            "response": "Share what partnership and ownership mean to you - long-term security, voice in decisions, or something else? Understanding the need helps me identify right opportunities" 
        },
        {
            "challenge": "I want neurohospitalist 7 on/7 off schedule only",
            "response": "Tell me what appeals about that schedule versus other patterns. Help me understand your priorities - concentrated work periods, predictability, time off?"
        }
    ],
    "challengingOpportunities": [
        "You mentioned preferring [specific location]. Help me understand what NEED that location solves - there might be other communities meeting those same needs you haven't considered",
        "I hear you want [specific subspecialty only]. What if you did primarily that work with some general neurology mixed in - would that be worth exploring if the package was compelling?",
        "You said minimal call coverage. Help me understand what 'minimal' means numerically. What if call volume was very low or well-supported - would that change your thinking?",
        "Many neurologists think they want pure outpatient until they realize the volume required for productivity targets. Have you thought about mixing inpatient work for more time control?",
        "You mentioned needing hospital employment for benefits. What if I showed you private practice with comparable benefits plus higher compensation and more autonomy?",
        "You said compensation is top priority. If I could show you a position addressing work-life balance so dramatically you could work more years without burnout, how would that factor in?"
    ]
}
