{
  "name": "Rheumatology",
  "icon": "🦴",
  "compensation": {
    "median": "$296,975",
    "range": "$252,037 - $353,343",
    "percentile25": "$252,037",
    "percentile50": "$296,975",
    "percentile75": "$353,343",
    "workRVUs": "5,384 (median)",
    "compensationPerRVU": "$55.97 (median)"
  },
  "painPoints": [
    {
      "category": "Access, Backlog & Panel Size",
      "points": [
        "Long new‑patient waitlists and limited follow‑up slots for complex autoimmune disease",
        "Panel sizes exceeding sustainable levels for disease monitoring and refills",
        "High no‑show rates and referral triage challenges impacting continuity",
        "Pressure to shorten visits despite complex medication management"
      ]
    },
    {
      "category": "Medication Management & Prior Authorization",
      "points": [
        "Time‑consuming prior authorizations for biologics and JAK inhibitors",
        "Step‑therapy and formulary switches disrupting stable treatment plans",
        "Frequent lab monitoring for DMARD toxicity adds administrative load",
        "Limited pharmacy support for benefits investigations and patient education"
      ]
    },
    {
      "category": "Infusion & Procedure Infrastructure",
      "points": [
        "Limited infusion chair availability and staffing constrain growth",
        "Fragmented workflows between clinic and infusion center",
        "Inconsistent ultrasound access for diagnostic/procedural work",
        "Space/equipment constraints for in‑office procedures (US‑guided injections)"
      ]
    },
    {
      "category": "Compensation & RVU Alignment",
      "points": [
        "RVU targets not reflecting cognitive complexity and care coordination time",
        "Opaque or inconsistent credit for infusion oversight and procedures",
        "Misalignment between quality metrics and realistic clinic operations",
        "Unclear pathway to leadership stipends (clinic lead, infusion director)"
      ]
    },
    {
      "category": "EHR & Care Coordination",
      "points": [
        "Heavy documentation burden for disease activity indices and prior auth packets",
        "Care coordination with primary care, ortho, derm, nephro adds non‑billable time",
        "Multiple portals/EHRs across hospital and clinic reduce efficiency",
        "Inbox volume (results, refills, messages) spills into after‑hours work"
      ]
    }
  ],
  "motivations": [
    "Predictable clinic templates with adequate new vs. follow‑up balance",
    "Dedicated prior authorization/pharmacy teams for biologics and DMARDs",
    "Integrated infusion center with reliable chair time and nursing support",
    "Point‑of‑care MSK ultrasound and procedure support",
    "Transparent compensation recognizing cognitive work and procedures",
    "Scribes/EHR optimization and protected admin time",
    "Leadership opportunities (Infusion Director, Quality, Fellowship teaching)",
    "4‑day clinic weeks, telehealth follow‑ups, and flexible scheduling",
    "Robust ancillary services (PT/OT, pharmacy, imaging) to streamline care",
    "Geographic relocation and lifestyle improvements for family"
  ],
  "keyQuestions": {
    "opening": [
      "Tell me about your current practice—clinic volume, disease mix, and any infusion involvement.",
      "What’s motivating you to explore new opportunities right now?",
      "What would you like to change in your next role to make your work more sustainable?"
    ],
    "painDiscovery": [
      "You mentioned [pain point]—how does that show up during a typical clinic week?",
      "Where do prior auths and step‑therapy cause the most disruption?",
      "How are infusion scheduling and nursing support affecting patient access?",
      "What part of documentation or inbox work takes the most time after hours?",
      "If you could fix one operational process tomorrow, what would it be and why?"
    ],
    "clinical": [
      "Describe your disease mix (RA, SLE, PsA, axial SpA, gout, vasculitis) and ideal balance.",
      "Typical daily volume and ideal template for new vs. follow‑ups?",
      "Comfort with MSK ultrasound and US‑guided injections—what equipment/support do you need?",
      "How do you manage infusion oversight—on‑site center, hospital, or external partner?",
      "What lab/imaging access and turnaround times do you need for DMARD safety monitoring?",
      "How do you coordinate care with derm/renal/ortho and manage complex flares?",
      "Interest in leadership (infusion, quality, fellowship) or research participation?",
      "Preferred use of telehealth for stable follow‑ups or medication counseling?"
    ],
    "motivation": [
      "When you picture your ideal rheumatology practice, what stands out—schedule, support, or compensation?",
      "What combination of clinic volume and PA/pharmacy support would feel sustainable?",
      "Which trade‑offs are acceptable (e.g., slightly higher volume for stronger infusion infrastructure)?",
      "What would make a move clearly worthwhile for you and your family over the next 12–24 months?"
    ],
    "compensation": [
      "Walk me through your current compensation—base, wRVU, procedure/infusion credit, and bonuses.",
      "What compensation structure best reflects your cognitive workload and coordination time?",
      "Which stipends (infusion directorship, quality, teaching) would make the plan feel fair?"
    ]
  },
  "commonChallenges": [
    {
      "challenge": "My panel size and new‑patient backlog are overwhelming.",
      "response": "What panel size and new‑patient slots per week would keep access and continuity healthy for you?"
    },
    {
      "challenge": "Prior authorizations for biologics are consuming too much time.",
      "response": "If we provided dedicated PA/pharmacy staff and standardized packets, how would that change your week?"
    },
    {
      "challenge": "Infusion access is limited and bottlenecks care.",
      "response": "How many infusion chairs and nursing FTEs would you need, and what hours would optimize flow?"
    },
    {
      "challenge": "My compensation doesn’t reflect the complexity of my work.",
      "response": "What mix of base, RVU credit, and procedure/infusion recognition would feel equitable?"
    },
    {
      "challenge": "Documentation and inbox volume are burning me out.",
      "response": "Would scribes, templates, or protected admin time meaningfully reduce after‑hours work for you?"
    }
  ],
  "challengingOpportunities": [
    "You mentioned backlog—if we guarantee protected new‑patient slots and add PA/pharmacy support, would that meet your access goals?",
    "If infusion capacity is the pain point, would added chairs, nursing, and extended hours address the core issue?",
    "If compensation fairness is key, would explicit recognition for procedures, infusion oversight, and quality roles align the plan with your effort?",
    "If documentation is the drain, would scribes, smart templates, and protected admin time restore balance for you?"
  ]
}