{
    "name": "Urology",
    "icon": "🩺",
    "compensation": {
        "median": "$573,137",
        "range": "$462,114 - $700,000",
        "percentile25": "$462,114",
        "percentile50": "$573,137",
        "percentile75": "$700,000",
        "workRVUs": "8,997 (median)",
        "compensationPerRVU": "$65.77 (median)",
        "privateVsAcademic": "Private practice 44% receive >$500/day call pay vs 7% academic"
    },
    "painPoints": [
        {
            "category": "Call Burden & Burnout",
            "points": [
                "Urology ranks among highest burnout rates (36-68% depending on setting)",
                "Call identified as most significant stressor - nearly half considering leaving due to call burden",
                "76% of female urologists required to take call vs 67% male",
                "Solo or small group practitioners working months without breaks",
                "Unpredictable on-call responsibilities blur work-life boundaries",
                "Early-career urologists (<45) showing increased burnout from 38% to 45%"
            ]
        },
        {
            "category": "Workforce Shortages & Coverage Issues",
            "points": [
                "By 2037, urology projected to fall to only 82% adequacy - 18% workforce gap",
                "63% of American counties have no urologist at all",
                "48.5% of rural urologists experience burnout at least monthly",
                "Difficulty with recruitment and succession planning in rural/underserved areas",
                "Chronic worry about patients without adequate backup coverage"
            ]
        },
        {
            "category": "Administrative Burden & Autonomy Loss",
            "points": [
                "Increasing regulation, bureaucracy, and declining autonomy cited as major burnout factors",
                "Prior authorization delays adding significant time burden",
                "EHR systems described as 'cumbersome' and 'one-size-fits-all'",
                "Decreasing reimbursement despite increased administrative requirements",
                "Time spent on non-clinical tasks reducing patient care time"
            ]
        },
        {
            "category": "Practice Consolidation Pressures",
            "points": [
                "Trend toward consolidation - small offices merging into 6-12+ person groups",
                "Private equity acquisitions affecting job security and income",
                "Solo practice survival becoming increasingly difficult",
                "Loss of autonomy in decision-making when employed by larger systems",
                "Partnership opportunities decreasing as hospital employment increases"
            ]
        },
        {
            "category": "Technology & Resource Limitations",
            "points": [
                "Limited access to robotic systems (da Vinci) in smaller settings",
                "Inadequate access to latest surgical technology and imaging",
                "High costs of new devices without proper reimbursement",
                "Regional disparities in access to advanced treatment modalities",
                "Insufficient OR block time limiting surgical volume"
            ]
        }
    ],
    "motivations": [
        "Reduced call burden and better call schedule (most frequently cited)",
        "Improved work-life balance and more personal time",
        "Less administrative hassle and non-clinical responsibilities",
        "Geographic location and lifestyle preferences",
        "Compensation improvement - particularly higher-paying regions",
        "Access to better technology (robotic systems, advanced imaging)",
        "Partnership in established group with financial stability",
        "Escape from solo practice isolation and lack of backup",
        "Better benefit packages (retirement, health insurance, malpractice)",
        "Team-based care model with APP support",
        "Employment security without business ownership risk",
        "Opportunity to practice full scope including complex cases"
    ],
    "keyQuestions": {
        "opening": [
            "Tell me about your current practice structure and what a typical day looks like",
            "What's driving you to explore new opportunities at this point in your career?",
            "Help me understand what you're looking for in your next position",
            "Walk me through your current call schedule and how it's affecting your life"
        ],
        "painDiscovery": [
            "You mentioned call burden - help me understand how that's impacting you and your family daily",
            "Tell me more about what led you to start looking for something different",
            "Describe your current work-life balance and where the biggest frustrations are",
            "How has the administrative burden been affecting your ability to practice medicine the way you want?",
            "Help me understand the moments that make you think 'I can't keep doing this'",
            "Share with me how your call coverage is structured and what that means for your personal time"
        ],
        "clinical": [
            "Describe your patient population and the types of cases you're managing regularly",
            "Help me understand your current surgical volume and case mix",
            "Tell me about your scope - what procedures are you doing versus what you'd like to be doing?",
            "Walk me through your access to technology - robotic systems, imaging, lithotripsy",
            "Share your experience with procedures you enjoy most and those you'd prefer to refer",
            "What's your current patient volume per day in clinic and how does that feel?",
            "Tell me about your experience with robotic surgery and comfort level with da Vinci systems",
            "What subspecialty interests do you have - oncology, robotics, stone disease, female urology?"
        ],
        "motivation": [
            "When you imagine your ideal urology practice, what does it look like?",
            "Help me understand what would make a move worthwhile for you and your family",
            "What are your top three priorities in evaluating a new opportunity?",
            "Describe what better work-life balance means to you specifically",
            "What role does call coverage play in your decision about opportunities?"
        ],
        "compensation": [
            "Help me understand your complete compensation structure - base, bonuses, productivity, benefits",
            "When you think about your next position, what compensation package would make a move worthwhile?",
            "Tell me about your financial goals and what's driving those expectations",
            "Share with me your thoughts on call pay - are you compensated separately for taking call?"
        ]
    },
    "commonChallenges": [
        { 
            "challenge": "Location concerns - rural or smaller community", 
            "response": "Help me understand what specific community features matter most to you and your family - schools, outdoor recreation, amenities, proximity to cities? What's driving your location preference?" 
        },
        { 
            "challenge": "Call coverage concerns", 
            "response": "Tell me about your ideal call schedule and what would make it sustainable long-term. What's worked well in the past and what hasn't?" 
        },
        { 
            "challenge": "Compensation expectations above market", 
            "response": "Help me understand what's driving those expectations and what trade-offs you'd consider. If we could address work-life balance or technology access exceptionally well, how would that affect your compensation requirements?" 
        },
        { 
            "challenge": "Wants partnership but concerned about buy-in costs", 
            "response": "Share with me your thoughts on practice ownership versus employed models. What does partnership represent to you beyond financial investment?" 
        },
        { 
            "challenge": "Technology requirements - wants latest robotic systems", 
            "response": "Tell me which technologies are truly essential to your practice versus nice-to-have. How would access to the right technology affect your satisfaction?" 
        },
        { 
            "challenge": "Concerned about patient volume and establishing practice", 
            "response": "Walk me through your thoughts on building a practice - what referral base, marketing support, and timeline would you need?" 
        },
        {
            "challenge": "Worried about solo practice or inadequate backup",
            "response": "Share your ideal group size and coverage model. What's been your experience with backup coverage and what would you need to feel supported?"
        },
        {
            "challenge": "Burnout from current position - needs immediate change",
            "response": "Help me understand what specifically needs to be different in your next role to prevent the same situation. What boundaries are non-negotiable for your wellbeing?"
        }
    ],
    "challengingOpportunities": [
        "I hear you prefer [specific location]. Help me understand what NEED that location solves for you - because there might be other communities that meet those same needs in ways you haven't considered",
        "You mentioned wanting [specific call schedule]. If I could show you how a different call model gives you more predictable free time and better backup coverage, would you be open to exploring that?",
        "Many urologists find that what they thought they wanted differs from what actually makes them happy long-term. What's truly non-negotiable versus nice-to-have?",
        "You said partnership is important. Help me understand what partnership represents to you - is it financial upside, autonomy, or something else?",
        "You mentioned technology access is a priority. If I could show you a practice with exceptional technology but requiring relocation to a smaller community, what would that conversation look like?",
        "Many burned-out urologists discover that reducing call and administrative burden matters more than they initially thought. If you could only optimize two things in your next role, what would they be?"
    ]
}
